app/controllers/articles_controller.rb

  def index
    #for /articles
    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def show
    #for /articles/'id'
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]

  def create
    @article = Article.new(article_params)
    # click on save button
    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "adsf"], ["text", "adfdf"], ["created_at", "2015-09-17 09:30:00.348379"], ["updated_at", "2015-09-17 09:30:00.348379"]]

  def update
    @article = Article.find(params[:id])
    # click on save button
    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "adsff"], ["text", "adfdfff"], ["updated_at", "2015-09-18 10:22:47.605599"], ["id", 4]]

  def destroy
    @article = Article.find(params[:id])
    # Active Record Object method
    @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]