app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Lukas"], ["body", "Teswt"], ["article_id", 4], ["created_at", "2015-09-18 09:46:10.201476"], ["updated_at", "2015-09-18 09:46:10.201476"]]
---
 def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)